micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_ltdc.c
  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Configure the default color values */
  LTDC_LAYER(hltdc, LayerIdx)->CKCR &=  ~(LTDC_LxCKCR_CKBLUE | LTDC_LxCKCR_CKGREEN | LTDC_LxCKCR_CKRED);
  LTDC_LAYER(hltdc, LayerIdx)->CKCR  = RGBValue;

  /* Set the Immediate Reload type */
  WRITE_REG(LTDC_LAYER(hltdc, LayerIdx)->RCR, LTDC_LxRCR_IMR | LTDC_LxRCR_GRMSK);

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief  Load the color lookup table.
  * @param  hltdc     pointer to a LTDC_HandleTypeDef structure that contains
  *                   the configuration information for the LTDC.
  * @param  pCLUT     pointer to the color lookup table address.
  * @param  CLUTSize  the color lookup table size.
  * @param  LayerIdx  LTDC Layer index.
  *                   This parameter can be one of the following values:
  *                   LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LTDC_ConfigCLUT(LTDC_HandleTypeDef *hltdc, const uint32_t *pCLUT, uint32_t CLUTSize,
                                      uint32_t LayerIdx)
{
  uint32_t tmp;
  uint32_t counter;
  const uint32_t *pcolorlut = pCLUT;
  /* Check the parameters */
  assert_param(IS_LTDC_LAYER(LayerIdx));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  for (counter = 0U; (counter < CLUTSize); counter++)
  {
    if (hltdc->LayerCfg[LayerIdx].PixelFormat == LTDC_PIXEL_FORMAT_AL44)
    {
      tmp  = (((counter + (16U * counter)) << 24U) | ((uint32_t)(*pcolorlut) & 0xFFU) | \
              ((uint32_t)(*pcolorlut) & 0xFF00U) | ((uint32_t)(*pcolorlut) & 0xFF0000U));
    }
    else
    {
      tmp  = ((counter << 24U) | ((uint32_t)(*pcolorlut) & 0xFFU) | \
              ((uint32_t)(*pcolorlut) & 0xFF00U) | ((uint32_t)(*pcolorlut) & 0xFF0000U));
    }

    pcolorlut++;

    /* Specifies the C-LUT address and RGB value */
    LTDC_LAYER(hltdc, LayerIdx)->CLUTWR  = tmp;
  }

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief Configures the gamma correction for the LTDC peripheral.
  *
  * This function sets up the gamma correction feature of the LTDC (Liquid Crystal Display Controller)
  * peripheral. Gamma correction helps in adjusting the brightness of the output image. This function
  * allows the configuration of the gamma curve by setting the values for ones, tenths, and the specific
  * RGB component to be adjusted.
  *
  * @param  hltdc      pointer to a LTDC_HandleTypeDef structure that contains
  *                    the configuration information for the LTDC.
  * @param GammaOnes Specifies the value for the ones place in the gamma correction factor.
  *                  This parameter can be a value between 0 and 2.
  * @param GammaTenths Specifies the value for the tenths place in the gamma correction factor.
  *                    This parameter can be a value between 0 and 9 if GammaOnes > 0 else between 4 and 9.
  * @param RGBComponent Specifies the RGB component to which the gamma correction is applied.
  *                     This parameter can be one of the following values:
  *                     @arg LTDC_RGB_COMPONENT_RED  : Gamma correction for the red component.
  *                     @arg LTDC_RGB_COMPONENT_GREEN: Gamma correction for the green component.
  *                     @arg LTDC_RGB_COMPONENT_BLUE : Gamma correction for the blue component.
  *                     @arg LTDC_RGB_COMPONENT_ALL  : Gamma correction for all components.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LTDC_ConfigGammaCorrection(LTDC_HandleTypeDef *hltdc, uint32_t GammaOnes,
                                                 uint32_t GammaTenths, uint32_t RGBComponent)
{
  const uint32_t gammaindex = (GammaOnes * 70U) + (GammaTenths  * 7U) - 28U;
  uint8_t gammasegment;
  const uint8_t GammaAdress[7] = {32, 64, 96, 128, 160, 192, 224};
  /* Gamma Mapped coefficients for segments 1 to 7 */
  const uint8_t GammaLUT[182] =
  {
    111, 147, 173, 194, 212, 228, 242,  /* Gamma = 0.4 */
    90, 128, 156, 181, 202, 221, 239,   /* Gamma = 0.5 */
    73, 111, 142, 169, 193, 215, 236,   /* Gamma = 0.6 */
    60, 97, 129, 157, 184, 209, 233,    /* Gamma = 0.7 */
    48, 84, 117, 147, 176, 203, 230,    /* Gamma = 0.8 */
    39, 73, 106, 137, 168, 198, 227,    /* Gamma = 0.9 */
    32, 64, 96, 128, 160, 192, 224,     /* Gamma = 1.0 */
    26, 56, 87, 119, 153, 187, 221,     /* Gamma = 1.1 */
    21, 49, 79, 112, 146, 181, 218,     /* Gamma = 1.2 */
    17, 42, 72, 104, 139, 176, 215,     /* Gamma = 1.3 */
    14, 37, 65, 97, 133, 171, 213,      /* Gamma = 1.4 */
    11, 32, 59, 91, 127, 167, 210,      /* Gamma = 1.5 */
    9, 28, 53, 85, 121, 162, 207,       /* Gamma = 1.6 */
    7, 24, 48, 79, 115, 157, 205,       /* Gamma = 1.7 */
    6, 21, 44, 74, 110, 153, 202,       /* Gamma = 1.8 */
    5, 18, 40, 69, 105, 149, 199,       /* Gamma = 1.9 */
    4, 16, 36, 64, 100, 145, 197,       /* Gamma = 2.0 */
    3, 14, 33, 60, 96, 141, 194,        /* Gamma = 2.1 */
    3, 12, 30, 56, 91, 137, 192,        /* Gamma = 2.2 */
    2, 11, 27, 52, 87, 133, 189,        /* Gamma = 2.3 */
    2, 9, 24, 49, 83, 129, 187,         /* Gamma = 2.4 */
    1, 8, 22, 46, 80, 125, 184,         /* Gamma = 2.5 */
    1, 7, 20, 42, 76, 122, 182,         /* Gamma = 2.6 */
    1, 6, 18, 40, 72, 119, 180,         /* Gamma = 2.7 */
    1, 5, 17, 37, 69, 115, 177,         /* Gamma = 2.8 */
    1, 5, 15, 35, 66, 112, 175,         /* Gamma = 2.9 */
  };

  /* Check the parameters */
  assert_param(IS_LTDC_RGB_COMPONENT(RGBComponent));
  assert_param(IS_LTDC_GAMMA_VALUE(GammaOnes, GammaTenths));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Set Gamma interpolated segments*/
  hltdc->Instance->GCCR = RGBComponent ;
  for (gammasegment = 0U; (gammasegment < 7U); gammasegment++)
  {
    hltdc->Instance->GCCR = RGBComponent | ((uint32_t) GammaAdress[gammasegment] << LTDC_GCCR_ADDR_Pos) |
                            ((uint32_t) GammaLUT[gammasegment + gammaindex] << LTDC_GCCR_COMP_Pos);
  }
  hltdc->Instance->GCCR = RGBComponent | (0xFFU << LTDC_GCCR_COMP_Pos) | LTDC_GCCR_ADDR;

