micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_ltdc.c
  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Get previous user configuration */
  LTDC_RetrieveUserConfig(hltdc, &mirror, &aux0Addr, &aux1Addr, LayerIdx);

  /* Update LayerCfg structure with required parameters */
  hltdc->LayerCfg[LayerIdx].FBStartAdress = pYUVFullPlanarAddress->YUVFullPlanarAddress.YAddress;

  /* Set LTDC parameters */
  LTDC_SetConfig(hltdc, pYUVFullPlanarAddress->YUVFullPlanarAddress.UAddress,
                 pYUVFullPlanarAddress->YUVFullPlanarAddress.VAddress, mirror, LayerIdx);

  /* Set the Immediate Reload type */
  WRITE_REG(LTDC_LAYER(hltdc, LayerIdx)->RCR, LTDC_LxRCR_IMR | LTDC_LxRCR_GRMSK);

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief Reconfigure the semi-planar memory addresses for a YUV layer in the LTDC peripheral.
  *
  * Configures the memory addresses for the Y plane and the combined U/V plane of a semi-planar YUV layer.
  * This function is used when the Layer is operating in a semi-planar mode, where the Y component and the
  * U/V components are stored in separate memory areas, allowing dynamic updates of the frame buffer addresses.
  *
  * @note This function is applicable only to LTDC_LAYER_1.
  *
  * @param hltdc Pointer to a LTDC_HandleTypeDef structure that contains the configuration information
  *              for the LTDC module.
  * @param pYUVSemiPlanarAddress Pointer to an LTDC_LayerFlexYUVSemiPlanarTypeDef structure that holds
  *                              the memory addresses for the Y plane and the combined U/V plane.
  * @param LayerIdx Specifies the index of the layer being configured. For this function, the only
  *                 valid value is LTDC_LAYER_1.
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_LTDC_SetSemiPlanarAddress(LTDC_HandleTypeDef *hltdc,
                                                LTDC_LayerFlexYUVSemiPlanarTypeDef *pYUVSemiPlanarAddress,
                                                uint32_t LayerIdx)
{
  uint32_t aux0Addr = 0U;
  uint32_t aux1Addr = 0U;
  uint32_t mirror = 0U;

  /* Check the parameters */
  assert_param(IS_LTDC_PLANAR_LAYER(LayerIdx));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Get previous user configuration */
  LTDC_RetrieveUserConfig(hltdc, &mirror, &aux0Addr, &aux1Addr, LayerIdx);

  /* Update handle */
  hltdc->LayerCfg[LayerIdx].FBStartAdress = pYUVSemiPlanarAddress->YUVSemiPlanarAddress.YAddress;

  /* Set LTDC parameters */
  LTDC_SetConfig(hltdc, pYUVSemiPlanarAddress->YUVSemiPlanarAddress.UVAddress, 0, mirror, LayerIdx);

  /* Set the Immediate Reload type */
  WRITE_REG(LTDC_LAYER(hltdc, LayerIdx)->RCR, LTDC_LxRCR_IMR | LTDC_LxRCR_GRMSK);

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief Reconfigure the full planar memory addresses for a YUV layer in the LTDC peripheral with no reload.
  *
  * Configures the memory addresses for the Y, U, and V planes of a full planar YUV layer. This function
  * is used when the Layer is operating in a full planar mode, where the Y, U, and V components are stored in
  * separate memory areas. It allows for dynamic updating of the frame buffer addresses.
  *
  * @note This function is applicable only to LTDC_LAYER_1.
  * @param hltdc Pointer to a LTDC_HandleTypeDef structure that contains the configuration information
  *              for the LTDC module.
  * @param pYUVFullPlanarAddress Pointer to a LTDC_LayerFlexYUVFullPlanarTypeDef structure that holds
  *                              the memory addresses for the Y, U, and V planes.
  * @param  LayerIdx  Specifies the index of the layer being configured. For this function, the only
  *                 valid value is LTDC_LAYER_1.
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_LTDC_SetFullPlanarAddress_NoReload(LTDC_HandleTypeDef *hltdc,
                                                         LTDC_LayerFlexYUVFullPlanarTypeDef *pYUVFullPlanarAddress,
                                                         uint32_t LayerIdx)
{
  uint32_t mirror = 0U;
  uint32_t aux0Addr = 0U;
  uint32_t aux1Addr = 0U;

  /* Check the parameters */
  assert_param(IS_LTDC_PLANAR_LAYER(LayerIdx));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Get previous user configuration */
  LTDC_RetrieveUserConfig(hltdc, &mirror, &aux0Addr, &aux1Addr, LayerIdx);

  /* Update LayerCfg structure with required parameters */
  hltdc->LayerCfg[LayerIdx].FBStartAdress = pYUVFullPlanarAddress->YUVFullPlanarAddress.YAddress;

  /* Set LTDC parameters */
  LTDC_SetConfig(hltdc, pYUVFullPlanarAddress->YUVFullPlanarAddress.UAddress,
                 pYUVFullPlanarAddress->YUVFullPlanarAddress.VAddress, mirror, LayerIdx);

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief Reconfigure the semi-planar memory addresses for a YUV layer in the LTDC peripheral without reload.
  *
  * Configures the memory addresses for the Y plane and the combined U/V plane of a semi-planar YUV layer.
  * This function is used when the Layer is operating in a semi-planar mode, where the Y component and the
  * U/V components are stored in separate memory areas, allowing dynamic updates of the frame buffer addresses.
  *
  * @note This function is applicable only to LTDC_LAYER_1.
  *
  * @param hltdc Pointer to a LTDC_HandleTypeDef structure that contains the configuration information
  *              for the LTDC module.
  * @param pYUVSemiPlanarAddress Pointer to an LTDC_LayerFlexYUVSemiPlanarTypeDef structure that holds
  *                              the memory addresses for the Y plane and the combined U/V plane.
  * @param LayerIdx Specifies the index of the layer being configured. For this function, the only
  *                 valid value is LTDC_LAYER_1.
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_LTDC_SetSemiPlanarAddress_NoReload(LTDC_HandleTypeDef *hltdc,
                                                         LTDC_LayerFlexYUVSemiPlanarTypeDef *pYUVSemiPlanarAddress,
                                                         uint32_t LayerIdx)
{
  uint32_t aux0Addr = 0U;
  uint32_t aux1Addr = 0U;
  uint32_t mirror = 0U;

  /* Check the parameters */
  assert_param(IS_LTDC_PLANAR_LAYER(LayerIdx));

  /* Process locked */
  __HAL_LOCK(hltdc);

