micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_ltdc.c
  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief  Enable the default ARGB8888 color for a specific LTDC layer.
  *
  * Each layer within the LTDC module has a default color in the ARGB8888 format, which is
  * displayed outside the defined layer window or when the layer itself is disabled.
  * This function enable the display of default color for a given layer.
  * @param  LayerIdx  LTDC Layer index.
  *                   This parameter can be one of the following values:
  *                   LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1).
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_LTDC_EnableDefaultColor(LTDC_HandleTypeDef *hltdc, uint32_t LayerIdx)
{
  /* Check the parameters */
  assert_param(IS_LTDC_LAYER(LayerIdx));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Enable Default Color Blending */
  SET_BIT(LTDC_LAYER(hltdc, LayerIdx)->CR, LTDC_LxCR_DCBEN);

  /* Set the Immediate Reload type */
  WRITE_REG(LTDC_LAYER(hltdc, LayerIdx)->RCR, LTDC_LxRCR_IMR | LTDC_LxRCR_GRMSK);

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief  Disable the default ARGB8888 color for a specific LTDC layer.
  *
  * Each layer within the LTDC module has a default color in the ARGB8888 format, which is
  * displayed outside the defined layer window or when the layer itself is disabled.
  * This function prevents the default color from being displayed when a  layer is disabled.
  *
  * @param  hltdc     pointer to a LTDC_HandleTypeDef structure that contains
  *                   the configuration information for the LTDC.
  * @param  LayerIdx  LTDC Layer index.
  *                   This parameter can be one of the following values:
  *                   LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1).
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_LTDC_DisableDefaultColor(LTDC_HandleTypeDef *hltdc, uint32_t LayerIdx)
{
  /* Check the parameters */
  assert_param(IS_LTDC_LAYER(LayerIdx));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Enable Default Color Blending */
  CLEAR_BIT(LTDC_LAYER(hltdc, LayerIdx)->CR, LTDC_LxCR_DCBEN);

  /* Set the Immediate Reload type */
  WRITE_REG(LTDC_LAYER(hltdc, LayerIdx)->RCR, LTDC_LxRCR_IMR | LTDC_LxRCR_GRMSK);

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}

/**
  * @brief Configure the blending order for a given layer.
  *
  * This function sets the blending order of the layers managed by the LTDC module.
  * The blending order determines how the layers are superimposed on each other.
  *
  * @param hltdc Pointer to a LTDC_HandleTypeDef structure that contains
  *              the configuration information for the LTDC module.
  * @param Order The blending order value. This parameter can be one of the following values:
  *              @arg LTDC_BLENDING_ORDER_FOREGROUND: Layer set in the foreground.
  *              @arg LTDC_BLENDING_ORDER_BACKGROUND: Layer set in the background.
  * @param LayerIdx Index of the layer being configured. This parameter can be one of the following:
  *                 @arg LTDC_LAYER_1: Layer 1 of the LTDC.
  *                 @arg LTDC_LAYER_2: Layer 2 of the LTDC.
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_LTDC_ConfigBlendingOrder(LTDC_HandleTypeDef *hltdc, uint32_t Order, uint32_t LayerIdx)
{
  /* Check the parameters */
  assert_param(IS_LTDC_LAYER(LayerIdx));
  assert_param(IS_LTDC_BLEND_ORDER(Order));

  /* Process locked */
  __HAL_LOCK(hltdc);

  /* Change LTDC peripheral state */
  hltdc->State = HAL_LTDC_STATE_BUSY;

  /* Set the blending order */
  MODIFY_REG(LTDC_LAYER(hltdc, LayerIdx)->BFCR, LTDC_LxBFCR_BOR, Order);

  /* Set the Immediate Reload type */
  WRITE_REG(LTDC_LAYER(hltdc, LayerIdx)->RCR, LTDC_LxRCR_IMR | LTDC_LxRCR_GRMSK);

  /* Change the LTDC state*/
  hltdc->State = HAL_LTDC_STATE_READY;

  /* Process unlocked */
  __HAL_UNLOCK(hltdc);

  return HAL_OK;
}
/**
  * @brief Retrieves the user configuration for a specific layer in the LTDC peripheral.
  *
  * This static function retrieves the current configuration for the specified layer, including the
  * mirroring setup and auxiliary buffer addresses.  It extracts the stride based on the pixel format
  * and calculates the buffer addresses accordingly. The retrieved configuration includes the mirror
  * orientation and the starting addresses of the color frame buffer and auxiliary buffers.
  *
  * @param hltdc Pointer to a LTDC_HandleTypeDef structure that contains the configuration information
  *              for the LTDC module.
  * @param Mirror Pointer to a uint32_t variable where the mirror configuration will be stored. The
  *               value will be one of the following:
  *               - LTDC_MIRROR_NONE: No mirroring.
  *               - LTDC_MIRROR_HORIZONTAL: Horizontal mirroring.
  *               - LTDC_MIRROR_VERTICAL: Vertical mirroring.
  *               - LTDC_MIRROR_HORIZONTAL_VERTICAL: Horizontal and vertical mirroring.
  * @param Aux0Addr Pointer to a uint32_t variable where the address of the first auxiliary buffer will
  *                 be stored, if applicable.
  * @param Aux1Addr Pointer to a uint32_t variable where the address of the second auxiliary buffer will
  *                 be stored, if applicable.
  * @param LayerIdx Specifies the index of the layer being queried. This parameter can be one of the
  *                 following values:
  *                 - LTDC_LAYER_1: Retrieve configuration for layer 1.
  *                 - LTDC_LAYER_2: Retrieve configuration for layer 2.
  *                 - Other layer indices as defined by the hardware and used within the driver.
  *
  * @note This function is intended for internal use within the LTDC driver and does not return a value.
  */
static void LTDC_RetrieveUserConfig(LTDC_HandleTypeDef *hltdc, uint32_t *Mirror, uint32_t *Aux0Addr,
                                    uint32_t *Aux1Addr, uint32_t LayerIdx)
{
  uint32_t stride;
  const uint32_t hmirror = ((LTDC_LAYER(hltdc, LayerIdx)->CR) & LTDC_LxCR_HMEN_Msk);
  const uint32_t pitchSign = (LTDC_LAYER(hltdc, LayerIdx)->CFBLR & LTDC_LxCFBLR_CFBP) & LTDC_PITCH_SIGN_MSK;

  switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
      stride = 4U;
      break;
    case LTDC_PIXEL_FORMAT_RGB888:
      stride = 3U;
      break;
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_AL88:
    case LTDC_PIXEL_FORMAT_FLEX_YUV_COPLANAR:
      stride = 2U;
      break;
    case LTDC_PIXEL_FORMAT_FLEX_ARGB:
      stride = ((LTDC_LAYER(hltdc, LayerIdx)->FPF1R) & LTDC_LxFPF1R_PSIZE_Msk) >> LTDC_LxFPF1R_PSIZE_Pos;
      break;
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
    default:
      stride = 1U;
      break;
  }

