micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_ltdc.c
  if ((pitchSign == 0U) && (hmirror == 0U))
  {
    *Mirror = LTDC_MIRROR_NONE;
    hltdc->LayerCfg[LayerIdx].FBStartAdress = LTDC_LAYER(hltdc, LayerIdx)->CFBAR;
    *Aux0Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA0R;
    *Aux1Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA1R;
  }
  else if ((pitchSign == 0U) && (hmirror == LTDC_LxCR_HMEN))
  {
    *Mirror = LTDC_MIRROR_HORIZONTAL;
    hltdc->LayerCfg[LayerIdx].FBStartAdress = LTDC_LAYER(hltdc, LayerIdx)->CFBAR - \
                                              (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                         hltdc->LayerCfg[LayerIdx].WindowX0)) + 1U;
    switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
        *Aux0Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA0R - \
                    (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 - \
                               hltdc->LayerCfg[LayerIdx].WindowX0)) + 1U;
        break;
      case LTDC_PIXEL_FORMAT_FLEX_YUV_FULLPLANAR:
        *Aux0Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA0R - \
                    (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U)) + 1U;
        *Aux1Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA1R - \
                    (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U)) + 1U;
        break;
      default:
        /* Nothing to do */
        break;
    }

  }
  else if ((pitchSign != 0U) && (hmirror == 0U))
  {
    *Mirror = LTDC_MIRROR_VERTICAL;
    hltdc->LayerCfg[LayerIdx].FBStartAdress = LTDC_LAYER(hltdc, LayerIdx)->CFBAR - \
                                              (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                         hltdc->LayerCfg[LayerIdx].WindowX0) * \
                                               ((hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                 hltdc->LayerCfg[LayerIdx].WindowY0) - 1U));
    switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
        *Aux0Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA0R - (stride * \
                                                           (hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                            hltdc->LayerCfg[LayerIdx].WindowX0) * \
                                                           (((hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                              hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U) - 1U));
        break;
      case LTDC_PIXEL_FORMAT_FLEX_YUV_FULLPLANAR:
        *Aux0Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA0R - (stride * \
                                                           ((hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                             hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) * \
                                                           (((hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                              hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U) - 1U));
        *Aux1Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA1R - (stride * \
                                                           ((hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                             hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) * \
                                                           (((hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                              hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U) - 1U));
        break;
      default:
        /* Nothing to do */
        break;
    }
  }

  else
  {
    *Mirror = LTDC_MIRROR_HORIZONTAL_VERTICAL;
    hltdc->LayerCfg[LayerIdx].FBStartAdress = LTDC_LAYER(hltdc, LayerIdx)->CFBAR - \
                                              (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                         hltdc->LayerCfg[LayerIdx].WindowX0) * \
                                               (hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                hltdc->LayerCfg[LayerIdx].WindowY0)) + 1U;
    switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
        *Aux0Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA0R - (stride * \
                                                           (hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                            hltdc->LayerCfg[LayerIdx].WindowX0) * \
                                                           ((hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                             hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U)) + 1U;
        break;
      case LTDC_PIXEL_FORMAT_FLEX_YUV_FULLPLANAR:
        *Aux0Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA0R - (stride * \
                                                           ((hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                             hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) * \
                                                           ((hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                             hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U)) + 1U;
        *Aux1Addr = LTDC_LAYER(hltdc, LayerIdx)->AFBA1R - (stride * \
                                                           ((hltdc->LayerCfg[LayerIdx].WindowX1 - \
                                                             hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) * \
                                                           ((hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                                             hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U)) + 1U;
        break;
      default:
        /* Nothing to do */
        break;
    }
  }
}

/**
  * @brief Set the configuration for a specific layer of the LTDC controller.
  *
  * This function configures a layer of the LTDC controller with the specified parameters.
  * It sets the pixel format stride, window positioning, color frame buffer address, auxiliary
  * frame buffer addresses, buffer length, and line number based on the layer configuration.
  * It also handles the mirroring configuration for the layer if specified.
  *
  * @param hltdc Pointer to a LTDC_HandleTypeDef structure that contains
  *              the configuration information for the specified LTDC.
  * @param Aux0Addr Auxiliary frame buffer address 0 used for certain pixel formats.
  * @param Aux1Addr Auxiliary frame buffer address 1 used for certain pixel formats.
  * @param Mirror Specifies the mirroring configuration for the layer. This parameter
  *               can be one of the following values:
  *               @arg LTDC_MIRROR_NONE: No mirroring.
  *               @arg LTDC_MIRROR_HORIZONTAL: Horizontal mirroring.
  *               @arg LTDC_MIRROR_VERTICAL: Vertical mirroring.
  *               @arg LTDC_MIRROR_HORIZONTAL_VERTICAL: Horizontal and vertical mirroring.
  * @param LayerIdx Index of the layer being configured. This parameter can be one of the following:
  *                 @arg LTDC_LAYER_1: Layer 1 of the LTDC.
  *                 @arg LTDC_LAYER_2: Layer 2 of the LTDC.
  *                 Depending on the LTDC hardware, additional layers may be supported.
  *
  * @note The stride is calculated based on the pixel format of the layer. The pixel format
  *       defines the number of bytes per pixel and hence the stride (the increment from one
  *       pixel to the next in a row of pixels). The function configures the layer window size
  *       and position, as well as the color and auxiliary frame buffer addresses, which are
  *       dependent on the mirroring configuration and pixel format. The buffer length and
  *       frame buffer line number are also set according to the pixel format and layer size.
  *       Mirroring settings are applied by adjusting the frame buffer start address and
  *       enabling the corresponding mirroring bits in the control register.
  *
  *       This function does not return a value as it is a static function used internally within the
  *        driver.
  */
static void LTDC_SetConfig(LTDC_HandleTypeDef *hltdc, uint32_t Aux0Addr, uint32_t Aux1Addr, uint32_t Mirror,
                           uint32_t LayerIdx)
{
  uint32_t stride;
  uint32_t tmp;

  /* Configure the frame buffer line number */
  LTDC_LAYER(hltdc, LayerIdx)->CFBLNR  = (hltdc->LayerCfg[LayerIdx].ImageHeight);

  switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
      stride = 4U;
      break;
    case LTDC_PIXEL_FORMAT_RGB888:
      stride = 3U;
      break;
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_AL88:
    case LTDC_PIXEL_FORMAT_FLEX_YUV_COPLANAR:
      stride = 2U;
      break;
    case LTDC_PIXEL_FORMAT_FLEX_ARGB:
      stride = (((LTDC_LAYER(hltdc, LayerIdx)->FPF1R) & LTDC_LxFPF1R_PSIZE_Msk) >> LTDC_LxFPF1R_PSIZE_Pos);
      break;
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
    default:
      stride = 1U;
      break;
  }

  /* Configure the horizontal start and stop position */
  tmp = ((hltdc->LayerCfg[LayerIdx].WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U)) << 16U);
  LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((hltdc->LayerCfg[LayerIdx].WindowX0 +
                                         ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U) + 1U) | tmp);

  /* Configure the vertical start and stop position */
  tmp = ((hltdc->LayerCfg[LayerIdx].WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16U);
  LTDC_LAYER(hltdc, LayerIdx)->WVPCR = ((hltdc->LayerCfg[LayerIdx].WindowY0 +
                                         (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1U) | tmp);

  if (Mirror == LTDC_MIRROR_NONE)
  {
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (hltdc->LayerCfg[LayerIdx].FBStartAdress);

    switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (hltdc->LayerCfg[LayerIdx].ImageWidth << 16U) |
                                             (hltdc->LayerCfg[LayerIdx].WindowX1 -
                                              hltdc->LayerCfg[LayerIdx].WindowX0 + 7U);
        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (hltdc->LayerCfg[LayerIdx].ImageHeight) >> 1U;
        break;
      case LTDC_PIXEL_FORMAT_FLEX_YUV_FULLPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = Aux1Addr;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((hltdc->LayerCfg[LayerIdx].ImageWidth >> 1U) << 16U) |
                                             (((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = (hltdc->LayerCfg[LayerIdx].ImageHeight) >> 1U;
        break;
      default:
        /* Nothing to do */
        break;
    }

    /* Configure the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR = (((hltdc->LayerCfg[LayerIdx].ImageWidth * stride) << 16U) |
                                          (((hltdc->LayerCfg[LayerIdx].WindowX1 - hltdc->LayerCfg[LayerIdx].WindowX0) *
                                            stride)  + 7U));

    /* Enable LTDC_Layer by setting LEN bit */
    MODIFY_REG(LTDC_LAYER(hltdc, LayerIdx)->CR,LTDC_LxCR_HMEN, LTDC_LxCR_LEN);
  }

  else if (Mirror == LTDC_MIRROR_HORIZONTAL)
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = hltdc->LayerCfg[LayerIdx].FBStartAdress +
                                         (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                    hltdc->LayerCfg[LayerIdx].WindowX0)) - 1U;

    switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr +
                                              (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                         hltdc->LayerCfg[LayerIdx].WindowX0)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (hltdc->LayerCfg[LayerIdx].ImageWidth << 16U) |
                                             (hltdc->LayerCfg[LayerIdx].WindowX1 - hltdc->LayerCfg[LayerIdx].WindowX0 +
                                              7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = hltdc->LayerCfg[LayerIdx].ImageHeight >> 1U ;
        break;
      case LTDC_PIXEL_FORMAT_FLEX_YUV_FULLPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr +
                                              (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                          hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = Aux1Addr +
                                              (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                          hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((hltdc->LayerCfg[LayerIdx].ImageWidth >> 1U) << 16U) |
                                             (((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = hltdc->LayerCfg[LayerIdx].ImageHeight >> 1U;
        break;
      default:
        /* Nothing to do */
        break;
    }

    /* Configure the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR = (((hltdc->LayerCfg[LayerIdx].ImageWidth * stride) << 16U) |
                                          (((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                             hltdc->LayerCfg[LayerIdx].WindowX0) * stride)  + 7U));

    /* Enable horizontal mirroring bit & LTDC_Layer by setting LEN bit */
    SET_BIT(LTDC_LAYER(hltdc, LayerIdx)->CR, LTDC_LxCR_HMEN | LTDC_LxCR_LEN);
  }

  else if (Mirror == LTDC_MIRROR_VERTICAL)
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = hltdc->LayerCfg[LayerIdx].FBStartAdress +
                                         (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                    hltdc->LayerCfg[LayerIdx].WindowX0) *
                                          ((hltdc->LayerCfg[LayerIdx].WindowY1 -
                                            hltdc->LayerCfg[LayerIdx].WindowY0) - 1U));

    switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr +
                                              (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                         hltdc->LayerCfg[LayerIdx].WindowX0) *
                                               (((hltdc->LayerCfg[LayerIdx].WindowY1 -
                                                  hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U) - 1U));

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((0x8000U - (hltdc->LayerCfg[LayerIdx].ImageWidth * stride)) << 16U) |
                                             (((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                hltdc->LayerCfg[LayerIdx].WindowX0) * stride)  + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = hltdc->LayerCfg[LayerIdx].ImageHeight >> 1U;
        break;
      case LTDC_PIXEL_FORMAT_FLEX_YUV_FULLPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr +
                                              (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                          hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) *
                                               (((hltdc->LayerCfg[LayerIdx].WindowY1 -
                                                  hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U) - 1U));

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = Aux1Addr +
                                              (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                          hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) *
                                               (((hltdc->LayerCfg[LayerIdx].WindowY1 -
                                                  hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U) - 1U));

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (((0x8000U - (hltdc->LayerCfg[LayerIdx].ImageWidth >> 1U)) *
                                               stride) << 16U) |
                                             ((((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                 hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) * stride) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = hltdc->LayerCfg[LayerIdx].ImageHeight >> 1U;
        break;
      default:
        /* Nothing to do */
        break;
    }

