micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_ltdc.c
    /* set the pitch */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = ((((0x8000U - (hltdc->LayerCfg[LayerIdx].ImageWidth * stride))) << 16U) |
                                           (((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                              hltdc->LayerCfg[LayerIdx].WindowX0) * stride) + 7U));

    /* Enable LTDC_Layer by setting LEN bit */
    MODIFY_REG(LTDC_LAYER(hltdc, LayerIdx)->CR, LTDC_LxCR_HMEN, LTDC_LxCR_LEN);
  }

  else
    /*  Mirror = LTDC_MIRROR_HORIZONTAL_VERTICAL */
  {
    /* Configure the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = hltdc->LayerCfg[LayerIdx].FBStartAdress +
                                         (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                    hltdc->LayerCfg[LayerIdx].WindowX0) *
                                          (hltdc->LayerCfg[LayerIdx].WindowY1 - \
                                           hltdc->LayerCfg[LayerIdx].WindowY0)) - 1U;

    switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
    {
      case LTDC_PIXEL_FORMAT_FLEX_YUV_SEMIPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr +
                                              (stride * (hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                         hltdc->LayerCfg[LayerIdx].WindowX0) *
                                               ((hltdc->LayerCfg[LayerIdx].WindowY1 -
                                                 hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = ((0x8000U - (hltdc->LayerCfg[LayerIdx].ImageWidth * stride)) << 16U) |
                                             (((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                hltdc->LayerCfg[LayerIdx].WindowX0) * stride) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = hltdc->LayerCfg[LayerIdx].ImageHeight >> 1U;
        break;
      case LTDC_PIXEL_FORMAT_FLEX_YUV_FULLPLANAR:
        /* Configure the auxiliary frame buffer address 0 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA0R = Aux0Addr +
                                              (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                          hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) *
                                               ((hltdc->LayerCfg[LayerIdx].WindowY1 -
                                                 hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U)) - 1U;

        /* Configure the auxiliary frame buffer address 1 */
        LTDC_LAYER(hltdc, LayerIdx)->AFBA1R = Aux1Addr +
                                              (stride * ((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                          hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) *
                                               ((hltdc->LayerCfg[LayerIdx].WindowY1 -
                                                 hltdc->LayerCfg[LayerIdx].WindowY0) >> 1U)) - 1U;

        /* Configure the buffer length */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLR = (((0x8000U - (hltdc->LayerCfg[LayerIdx].ImageWidth >> 1U)) * stride)
                                              << 16U) |
                                             ((((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                                 hltdc->LayerCfg[LayerIdx].WindowX0) >> 1U) * stride) + 7U);

        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR &= ~(LTDC_L1AFBLNR_AFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->AFBLNR = hltdc->LayerCfg[LayerIdx].ImageHeight >> 1U;
        break;
      default:
        /* Nothing to do */
        break;
    }

    LTDC_LAYER(hltdc, LayerIdx)->CFBLR  = ((((0x8000U - (hltdc->LayerCfg[LayerIdx].ImageWidth * stride))) << 16U) |
                                           (((hltdc->LayerCfg[LayerIdx].WindowX1 -
                                              hltdc->LayerCfg[LayerIdx].WindowX0) * stride) + 7U));

    /* Enable horizontal mirroring bit & LTDC_Layer by setting LEN bit */
    SET_BIT(LTDC_LAYER(hltdc, LayerIdx)->CR, LTDC_LxCR_HMEN | LTDC_LxCR_LEN);
  }
}

/**
  * @brief Configures the composition parameters for the specified layer in the LTDC peripheral.
  *
  * This static function sets the default color values, constant alpha value, and blending factors for
  * the specified layer of the LTDC. The configuration is based on the LayerCfg structure within the
  * LTDC handle, which includes the background color, alpha values, and blending factors.
  *
  * @param hltdc Pointer to a LTDC_HandleTypeDef structure that contains the configuration information
  *              for the LTDC module.
  * @param LayerIdx Specifies the index of the layer being configured. This parameter can be one of the
  *                 following values:
  *                 - LTDC_LAYER_1: Configuration for layer 1.
  *                 - LTDC_LAYER_2: Configuration for layer 2.
  *                 - Other layer indices as defined by the hardware and used within the driver.
  *
  * @note This function is intended for internal use within the LTDC driver and does not return a value.
 */
static void LTDC_SetCompositionConfig(LTDC_HandleTypeDef *hltdc, uint32_t LayerIdx)
{
  uint32_t tmp;
  uint32_t tmp1;
  uint32_t tmp2;

  /* Configure the default color values */
  tmp = ((uint32_t)(hltdc->LayerCfg[LayerIdx].Backcolor.Green) << 8U);
  tmp1 = ((uint32_t)(hltdc->LayerCfg[LayerIdx].Backcolor.Red) << 16U);
  tmp2 = (hltdc->LayerCfg[LayerIdx].Alpha0 << 24U);
  WRITE_REG(LTDC_LAYER(hltdc, LayerIdx)->DCCR, (hltdc->LayerCfg[LayerIdx].Backcolor.Blue | tmp | tmp1 | tmp2));

  /* Specifies the constant alpha value */
  LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
  LTDC_LAYER(hltdc, LayerIdx)->CACR = (hltdc->LayerCfg[LayerIdx].Alpha);

  /* Specifies the blending factors */
  LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BOR | LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
  tmp = ((uint32_t)(LTDC_LAYER(hltdc, LayerIdx)->BFCR & LTDC_LxBFCR_BOR_Msk) >> LTDC_LxBFCR_BOR_Pos) << 16U;
  LTDC_LAYER(hltdc, LayerIdx)->BFCR = (hltdc->LayerCfg[LayerIdx].BlendingFactor1 |
                                       hltdc->LayerCfg[LayerIdx].BlendingFactor2 | tmp);
}

/**
  * @brief Sets a software predefined ARGB pixel format using flexible ARGB parameters for the specified layer.
  *
  * This function configures the specified layer of the LTDC to use a software predefined ARGB pixel
  * format. The desired format is specified by the PixelFormat parameter within the LTDC handle.
  * @param  hltdc     Pointer to a LTDC_HandleTypeDef structure that contains
  *                   the configuration information for the LTDC.
  * @param  LayerIdx  LTDC Layer index.
  *                   This parameter can be one of the following values: LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1)
  * @retval None
  *
  *  @note This function does not return a value as it is a static function used internally within the
  *        driver.
  */
static void LTDC_SetPredefFormat(LTDC_HandleTypeDef *hltdc, uint32_t LayerIdx)
{
  uint32_t PSIZE = 0U;
  uint32_t ALEN = 0U;
  uint32_t APOS = 0U;
  uint32_t RLEN = 0U;
  uint32_t RPOS = 0U;
  uint32_t BLEN = 0U;
  uint32_t BPOS = 0U;
  uint32_t GLEN = 0U;
  uint32_t GPOS = 0U;

  /* Specify Flex ARGB parameters according to pixel format */
  switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB1555:
      PSIZE = 2U;
      ALEN = 1U;
      APOS = 15U;
      RLEN = 5U;
      RPOS = 10U;
      GLEN = 5U;
      GPOS = 5U;
      BLEN = 5U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_ARGB4444:
      PSIZE = 2U;
      ALEN = 4U;
      APOS = 12U;
      RLEN = 4U;
      RPOS = 8U;
      GLEN = 4U;
      GPOS = 4U;
      BLEN = 4U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_L8:
      PSIZE = 1U;
      ALEN = 0U;
      APOS = 0U;
      RLEN = 8U;
      RPOS = 0U;
      GLEN = 8U;
      GPOS = 0U;
      BLEN = 8U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_AL44:
      PSIZE = 1U;
      ALEN = 4U;
      APOS = 4U;
      RLEN = 4U;
      RPOS = 0U;
      GLEN = 4U;
      GPOS = 0U;
      BLEN = 4U;
      BPOS = 0U;
      break;
    case LTDC_PIXEL_FORMAT_AL88:
      PSIZE = 2U;
      ALEN = 8U;
      APOS = 8U;
      RLEN = 8U;
      RPOS = 0U;
      GLEN = 8U;
      GPOS = 0U;
      BLEN = 8U;
      BPOS = 0U;
      break;
    default:
      break;
  }

  switch (hltdc->LayerCfg[LayerIdx].PixelFormat)
  {
    case LTDC_PIXEL_FORMAT_ARGB8888:
    case LTDC_PIXEL_FORMAT_ABGR8888:
    case LTDC_PIXEL_FORMAT_RGBA8888:
    case LTDC_PIXEL_FORMAT_BGRA8888:
    case LTDC_PIXEL_FORMAT_RGB565:
    case LTDC_PIXEL_FORMAT_BGR565:
    case LTDC_PIXEL_FORMAT_RGB888:
      LTDC_LAYER(hltdc, LayerIdx)->PFCR = (hltdc->LayerCfg[LayerIdx].PixelFormat);
      LTDC_LAYER(hltdc, LayerIdx)->FPF0R = 0U;
      LTDC_LAYER(hltdc, LayerIdx)->FPF1R = 0U;
      break;
    case LTDC_PIXEL_FORMAT_ARGB1555:
    case LTDC_PIXEL_FORMAT_ARGB4444:
    case LTDC_PIXEL_FORMAT_L8:
    case LTDC_PIXEL_FORMAT_AL44:
    case LTDC_PIXEL_FORMAT_AL88:
      LTDC_LAYER(hltdc, LayerIdx)->PFCR = LTDC_LxPFCR_PF;
      LTDC_LAYER(hltdc, LayerIdx)->FPF0R = (RLEN << LTDC_LxFPF0R_RLEN_Pos) +
                                           (RPOS << LTDC_LxFPF0R_RPOS_Pos) +
                                           (ALEN << LTDC_LxFPF0R_ALEN_Pos) +
                                           APOS;
      LTDC_LAYER(hltdc, LayerIdx)->FPF1R = (PSIZE << LTDC_LxFPF1R_PSIZE_Pos) +
                                           (BLEN << LTDC_LxFPF1R_BLEN_Pos)  +
                                           (BPOS << LTDC_LxFPF1R_BPOS_Pos) +
                                           (GLEN << LTDC_LxFPF1R_GLEN_Pos) +
                                           GPOS;
      break;
    default:
      break;
  }
}
/**
  * @}
  */


/**
  * @}
  */

#endif /* LTDC */

#endif /* HAL_LTDC_MODULE_ENABLED */

/**
  * @}
  */

